Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Class
 The CurvedDimensionSetOrthogonalAttributes class contains the attributes for managing all the attributes of the curved dimension with orthogonal reference lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionSetOrthogonalAttributes : CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionSetOrthogonalAttributes
	Inherits CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
The CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes type exposes the following members.
Constructors
Name | Description
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes()
 Creates a new curved dimension set orthogonal attributes instance which loads standard attributes.
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes(String)
 Creates a new curved dimension set orthogonal attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Color
 The color of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Format
 The format attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Placing
 The placing attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Text
 The text attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
 (Inherited from DimensionSetBaseAttributes.)
TrueColor
 The true color (RGB enabled) of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace